## FairyWooBang日报 2018/09/14 第8期

### 提升外语水平从平时做起 

预计 **10分钟读完**
**链接**：https://sspai.com/post/45901
**简评**：上学时没学好英文，等工作了发现想看看外面的世界，需要良好的英文水平。为自己搭建一个英文学习环境，更投入的学习外语。
**标签**： `指南`  `学习`

### 过生日都有哪些羊毛可以薅？ 

预计 **5分钟读完**
**链接**：https://sspai.com/post/46212
**简评**：当我发现这篇文章时，我刚刚过完我的生日。蜜汁难受。收集不少生日月或者生日当天的福利，以备不时之需。
**标签**： `指南`

### 当只有一个类来实现时，我需要使用接口吗 

预计 **15分钟读完**
**链接**：https://softwareengineering.stackexchange.com/questions/159813/do-i-need-to-use-an-interface-when-only-one-class-will-ever-implement-it
**简评**：之前留下的一个疑问，当我只有一个实现类时还需要以实现一个接口的方式来实现方案是否合理。默默读完，还是得写一个。
**标签**： `编程`

### 用半小时加密你的一切 

预计 **8分钟读完**
**链接**：https://www.chinagfw.org/2018/08/blog-post_27.html
**简评**：在里面讲解了一些信息安全上的技巧和推荐的软件。在国内，隐私等问题感觉往往都被忽视，但随着互联网发展，个人隐私问题也会变得越来越重要。我们无法要求大公司不拿我们的信息作恶，但我们需要保护自己的信息，让大公司无法轻易作恶。
**标签**： `指南`

### 构建流畅的交互界面 

预计 **15分钟读完**
**链接**：https://juejin.im/post/5b7e2b34e51d4538843612cc
**简评**：以WWDC 2018关于iphoneX上的流畅的交互的介绍为切入点，介绍了比较推荐的8种流畅的交互体验的设计理念和实现。无论是设计还是开发都可以了解一下。
**标签**： `趋势`  `设计`  `编程`

### 改善命令行Tips 

预计 **8分钟读完**
**链接**：https://remysharp.com/2018/08/23/cli-improved
**简评**：作为开发，总会使用命令行来做种种操作。对于一些常用的命令提供了更有解。可以尝试改善下自己的命令行习惯
**标签**： `编程`

------

##### 我们每天挑选5篇认为高质量的文章，针对每篇文章拟一个标题写几句简单评论，组成5篇左右的FairyWooBang日报。如果喜欢，请关注`FairyWooBang`微信公众号。

Photo by [Ryan Loughlin](https://unsplash.com/photos/kUJp-TkpCDE?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText) on [Unsplash
